Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
data = [4,8,15,16,23,42]

In [3]:
s = pd.Series(data)

In [4]:
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(s)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
my_list  = [1,2,3,4,5,6,7,8,9,10]

In [7]:
type(my_list)

list

In [8]:
series = pd.Series(my_list)

In [9]:
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

##### Name  Age  Gender
##### 0   Alice   25  Female
##### 1     Bob   30    Male
##### 2  Claire   27  Female

In [10]:
cols=["Name" , "Age" , "Gender"]
data=[["Alice" , 25 , "Female"] , ["Bob" , "30" , "Male"] , ["Claire" , "27" , "Female"]]
pd.DataFrame(data , columns=cols)

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame:DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. 
You can think of it like a spreadsheet or SQL table, or a dict of Series objects. 
It is generally the most commonly used pandas object.

DataFrames can be used to store a wide variety of data, including numbers, strings, dates, and times. They can also be used to store data that is not evenly spaced, such as time series data.
Pandas DataFrames are a powerful tool for data analysis and manipulation.

How is it different from pandas.series?

Series is a one-dimensional data structure in pandas that is often thought of as a single column of a DataFrame. Each Series has an associated index, which can be used to label and access individual elements. While DataFrames can be thought of as a collection of Series, Series are single columns with labels.

In [13]:
#Example of DataFrame
import pandas as pd
data = {"Name" : ["Alice" , "Bob" , "Chrlie" , "David"] , 
        "Age" : [25 , 30 , 35 , 40] ,
        "City" : ["New york"  ,"Los Angeles" , "Chicago" , "Houston"]}
pd.DataFrame(data)

     Name  Age         City
0   Alice   25     New york
1     Bob   30  Los Angeles
2  Chrlie   35      Chicago
3   David   40      Houston

In [15]:
#Example of Series
import pandas as pd
ages = pd.Series([25 , 76 , 97 , 34] , name = "Age")
print(ages)

0    25
1    76
2    97
3    34
Name: Age, dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Pandas provides a wide range of functions and methods to manipulate data in a DataFrame. Here are some common functions you can use to work with Pandas DataFrames, along with examples of when you might use them:

1. read_csv()
This is one of the most crucial pandas methods in Python. read_csv() function helps read a comma-separated values (csv) file into a Pandas DataFrame.

In [16]:
url = "https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data"

# Define the column names
col_names = ["sepal_length_in_cm",
            "sepal_width_in_cm",
            "petal_length_in_cm",
            "petal_width_in_cm",
            "class"]

# Read data from URL
df = pd.read_csv(url, names=col_names)

In [17]:
df

,sepal_length_in_cm,sepal_width_in_cm,petal_length_in_cm,petal_width_in_cm,class
0,5.1,3.5,1.4,0.2,Iris-setosa
1,4.9,3.0,1.4,0.2,Iris-setosa
2,4.7,3.2,1.3,0.2,Iris-setosa
3,4.6,3.1,1.5,0.2,Iris-setosa
4,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica
146,6.3,2.5,5.0,1.9,Iris-virginica
147,6.5,3.0,5.2,2.0,Iris-virginica
148,6.2,3.4,5.4,2.3,Iris-virginica
149,5.9,3.0,5.1,1.8,Iris-virginica

2. head()
head(n) is used to return the first n rows of a dataset. By default, df.head() will return the first 5 rows of the DataFrame. If you want more/less number of rows, you can specify n as an integer.

In [18]:
df.head()

,sepal_length_in_cm,sepal_width_in_cm,petal_length_in_cm,petal_width_in_cm,class
0,5.1,3.5,1.4,0.2,Iris-setosa
1,4.9,3.0,1.4,0.2,Iris-setosa
2,4.7,3.2,1.3,0.2,Iris-setosa
3,4.6,3.1,1.5,0.2,Iris-setosa
4,5.0,3.6,1.4,0.2,Iris-setosa

3. describe()
describe() is used to generate descriptive statistics of the data in a Pandas DataFrame or Series. It summarizes central tendency and dispersion of the dataset. describe() helps in getting a quick overview of the dataset.

In [20]:
df.describe()

,sepal_length_in_cm,sepal_width_in_cm,petal_length_in_cm,petal_width_in_cm
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.054000,3.758667,1.198667
std,0.828066,0.433594,1.764420,0.763161
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In pandas, the Series and DataFrame are mutable, while the Panel is not.

Series: Series is a one-dimensional data structure, and it is mutable. You can modify the values, add or remove elements, and change the index labels of a Series.

DataFrame: DataFrame is a two-dimensional data structure, and it is also mutable. You can add or remove columns, change the values within the DataFrame, and modify the index and column labels.

Panel: The Panel was a three-dimensional data structure in older versions of pandas, but it has been deprecated . It is no longer part of the core pandas library.

So, to summarize, Series and DataFrames are mutable, while the Panel is no longer a part of pandas.

Q7.Create a DataFrame using multiple Series. Explain with an example.

In [24]:
import pandas as pd

name = pd.Series(["Alice" , "Bob" , "Charlie"])
age = pd.Series([22,34,67])
place = pd.Series(["New york" , "Chicago" , "Los Angeles"])

data = {"Name":name , "Age":age , "Place":place}

df = pd.DataFrame(data)

print(df)

      Name  Age        Place
0    Alice   22     New york
1      Bob   34      Chicago
2  Charlie   67  Los Angeles

In [25]:
df.head()

      Name  Age        Place
0    Alice   22     New york
1      Bob   34      Chicago
2  Charlie   67  Los Angeles